// Напишите програму, которая принимает на вход число и выдаёт количество цифр в числе
// 456 -> 3
// 78 -> 2
// 89126 -> 5

/*
int DigitCount(int num)
{
    num = Math.Abs(num);
    int count = 1;
    while(num > 10)
    {
        num /= 10;
        count++;
    }
    return count;
}

System.Console.Write("Input num:  ");
int num = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine(DigitCount(num));
*/

// Напишите программу